app/controllers/account_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 3)
INSERT INTO "connections" ("created_at", "updated_at", "from_id", "to_id") VALUES('2010-07-14 11:11:11', '2010-07-14 11:11:11', 3, 1)
---
  def follow
    @me = current_user
    @user = User.find(params[:id])
    @con = Connection.create(:from_id => @me.id,
                      :to_id => @user.id)

SELECT * FROM "users" WHERE ("users"."name" = 'brazil') LIMIT 1
---
  def authorize
    name = params[:user][:name]
    pw = params[:user][:passwd]
    u = User.find_by_name(name)

INSERT INTO "users" ("name", "created_at", "updated_at", "bio", "passwd") VALUES('brazil', '2010-07-14 10:22:37', '2010-07-14 10:22:37', NULL, 'brazil')
---
  def create
    @user = User.create(params[:user])

SELECT * FROM "users" WHERE ("users"."id" = 3)
---
  def index
    @user = User.find(session[:user_id])