app/controllers/timeline_controller.rb

INSERT INTO "tweets" ("created_at", "body", "updated_at", "user_id") VALUES('2010-07-14 10:50:36', 'ほげ', '2010-07-14 10:50:36', 1)
---
  def create
    @me = current_user
    @tweet = Tweet.new(params[:tweet])
    @tweet.user_id = @me.id
    @tweet.save

SELECT * FROM "users" WHERE ("users"."name" = 'brazil') LIMIT 1
---
  def user
    @me = current_user
    @user = User.find_by_name(params[:id])